{
	"Name": "ShowGridMoreInfo",
	"DisplayName": "Show More Grid Info | 显示格子更多的信息",
	"GameVersion": 1.2,
	"Version": 1.0,
	"Desc": "[Author | 作者]\r\nJai, Akira\r\n\r\n[Translator | 翻译者]\r\nDalois, Jai\r\n\r\n[Introduction | 简介]\r\n※Modified from More Grid Info mod from desktop version. Enhances the Grid Info displayed in the game. The enhanced Grid Info shows the following information of the selected tile:\r\nThe Grid Info panel is enhanced, showing the following information of the selected tile:\r\n  1. Qi value\r\n  2. Current and maximum Gather Qi values (see below)\r\n  3. Terrain & Flooring\r\n  4. Fertility (description & numeric value)\r\n  5. Attractiveness (description & numeric value)\r\n  6. Light (description & numeric value)\r\n  7. Temperature (description & numeric value)\r\n    * Maximum Gather Qi value is determined by adding the Gather Qi value of all Gather Qi objects that are capable of reaching the selected tile. Qi will gradually gather (up to the maximum) onto the tile over 5 days, increasing the tile's Qi value. The gathered Qi will reset to 0 whenever any Gather Qi item is placed or removed, causing a change in the maximum Gather Qi value on the tile. The Gather Qi value will reach maximum again after 5 days.\r\n\r\nIn addition, when the Feng Shui Vision is activated, the Grid Info panel would change to display Qi value, Gather Qi values and the Elemental Composition of the tile. There are 2 values displayed for each element:\r\n  1. The numeric amount of the element's emission on the tile\r\n  2. The percentage of the particular element over all the elements\r\n    * Elemental strength can be roughly calculated using the percentages with the following formula:\r\n      * (Feeding element - suppressing element) * 2 + (cultivator's element)\r\n\r\nLastly, information of unexplored grids/tiles can also be shown with this mod.\r\n\r\n\r\n格子信息面板加强后，显示以下信息：\r\n  1. 灵气值\r\n  2. 现聚气值和最大聚气值（请阅读下文）\r\n  3. 地形与地板\r\n  4. 肥沃度（文字描述与数值）\r\n  5. 美观（文字描述与数值）\r\n  6. 亮度（文字描述与数值）\r\n  7. 温度（文字描述与数值）\r\n    * 最大聚气值是把全部有效范围能抵达已选格子的聚灵物品的聚灵值加起来而统计出来的。灵气会在5天内聚集在已选格子（最多到最大值），增加格子的灵气值。现有聚气值会在聚气物品被放置或移除时（导致最大聚气值变化）归零。之后聚气值需5天才能回到最大值。\r\n\r\n除此之外，在【风水视野】启动时，格子信息面板会转成显示灵气值、各个聚气值、以及五行属性。每个五行元素会有2个数值被显示：\r\n  1. 该元素在已选格子的数值\r\n  2. 该元素与其他五行元素的百分百比例\r\n    * 元素强度值可由这五行的百分百比例计算：\r\n      * （生元素 - 克元素）* 2 + （弟子功法五行元素）\r\n\r\n最后，未探索的格子可由此 MOD 显示信息。",
	"Author": "Jai, Akira",
	"UIPackage": null,
	"Tags":["Function","Usability","ExcludeRealmsHeaven"],
	"IncreasedDesc": "",
	"Previews": [],
	"ParentModInfo": null
}
